lkolbly/cmsis-svd/data/TexasInstruments/LM3S9B96.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Register map for NVIC peripheral</description>
      <groupName>NVIC</groupName>
      <prependToName>NVIC</prependToName>
      <baseAddress>0xE000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INT_TYPE</name>
          <description>Interrupt Controller Type Reg</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>NVIC_INT_TYPE_LINES</name>
              <description>Number of interrupt lines (x32)</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTLR</name>
          <description>Auxiliary Control</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>NVIC_ACTLR_DISMCYC</name>
              <description>Disable Interrupts of Multiple Cycle Instructions</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_ACTLR_DISWBUF</name>
              <description>Disable Write Buffer</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_ACTLR_DISFOLD</name>
              <description>Disable IT Folding</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_CTRL</name>
          <description>SysTick Control and Status Register</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>NVIC_ST_CTRL_ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_ST_CTRL_INTEN</name>
              <description>Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_ST_CTRL_CLK_SRC</name>
              <description>Clock Source</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_ST_CTRL_COUNT</name>
              <description>Count Flag</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_RELOAD</name>
          <description>SysTick Reload Value Register</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>NVIC_ST_RELOAD</name>
              <description>Reload Value</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_CURRENT</name>
          <description>SysTick Current Value Register</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>NVIC_ST_CURRENT</name>
              <description>Current Value</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_CAL</name>
          <description>SysTick Calibration Value Reg</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>NVIC_ST_CAL_ONEMS</name>
              <description>1ms reference value</description>
              <bitRange>[23:0]</bitRange>
            </field>
            <field>
              <name>NVIC_ST_CAL_SKEW</name>
              <description>Clock skew</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>NVIC_ST_CAL_NOREF</name>
              <description>No reference clock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EN0</name>
          <description>Interrupt 0-31 Set Enable</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>NVIC_EN0_INT</name>
              <description>Interrupt Enable</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_EN0_INT0</name>
                  <description>Interrupt 0 enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT1</name>
                  <description>Interrupt 1 enable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT2</name>
                  <description>Interrupt 2 enable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT3</name>
                  <description>Interrupt 3 enable</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT4</name>
                  <description>Interrupt 4 enable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT5</name>
                  <description>Interrupt 5 enable</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT6</name>
                  <description>Interrupt 6 enable</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT7</name>
                  <description>Interrupt 7 enable</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT8</name>
                  <description>Interrupt 8 enable</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT9</name>
                  <description>Interrupt 9 enable</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT10</name>
                  <description>Interrupt 10 enable</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT11</name>
                  <description>Interrupt 11 enable</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT12</name>
                  <description>Interrupt 12 enable</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT13</name>
                  <description>Interrupt 13 enable</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT14</name>
                  <description>Interrupt 14 enable</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT15</name>
                  <description>Interrupt 15 enable</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT16</name>
                  <description>Interrupt 16 enable</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT17</name>
                  <description>Interrupt 17 enable</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT18</name>
                  <description>Interrupt 18 enable</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT19</name>
                  <description>Interrupt 19 enable</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT20</name>
                  <description>Interrupt 20 enable</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT21</name>
                  <description>Interrupt 21 enable</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT22</name>
                  <description>Interrupt 22 enable</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT23</name>
                  <description>Interrupt 23 enable</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT24</name>
                  <description>Interrupt 24 enable</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT25</name>
                  <description>Interrupt 25 enable</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT26</name>
                  <description>Interrupt 26 enable</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT27</name>
                  <description>Interrupt 27 enable</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT28</name>
                  <description>Interrupt 28 enable</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT29</name>
                  <description>Interrupt 29 enable</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT30</name>
                  <description>Interrupt 30 enable</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN0_INT31</name>
                  <description>Interrupt 31 enable</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EN1</name>
          <description>Interrupt 32-54 Set Enable</description>
          <addressOffset>0x00000104</addressOffset>
          <fields>
            <field>
              <name>NVIC_EN1_INT</name>
              <description>Interrupt Enable</description>
              <bitRange>[22:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_EN1_INT32</name>
                  <description>Interrupt 32 enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT33</name>
                  <description>Interrupt 33 enable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT34</name>
                  <description>Interrupt 34 enable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT35</name>
                  <description>Interrupt 35 enable</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT36</name>
                  <description>Interrupt 36 enable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT37</name>
                  <description>Interrupt 37 enable</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT38</name>
                  <description>Interrupt 38 enable</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT39</name>
                  <description>Interrupt 39 enable</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT40</name>
                  <description>Interrupt 40 enable</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT41</name>
                  <description>Interrupt 41 enable</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT42</name>
                  <description>Interrupt 42 enable</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT43</name>
                  <description>Interrupt 43 enable</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT44</name>
                  <description>Interrupt 44 enable</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT45</name>
                  <description>Interrupt 45 enable</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT46</name>
                  <description>Interrupt 46 enable</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_EN1_INT47</name>
                  <description>Interrupt 47 enable</description>
                  <value>0x8000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS0</name>
          <description>Interrupt 0-31 Clear Enable</description>
          <addressOffset>0x00000180</addressOffset>
          <fields>
            <field>
              <name>NVIC_DIS0_INT</name>
              <description>Interrupt Disable</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT0</name>
                  <description>Interrupt 0 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT1</name>
                  <description>Interrupt 1 disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT2</name>
                  <description>Interrupt 2 disable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT3</name>
                  <description>Interrupt 3 disable</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT4</name>
                  <description>Interrupt 4 disable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT5</name>
                  <description>Interrupt 5 disable</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT6</name>
                  <description>Interrupt 6 disable</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT7</name>
                  <description>Interrupt 7 disable</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT8</name>
                  <description>Interrupt 8 disable</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT9</name>
                  <description>Interrupt 9 disable</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT10</name>
                  <description>Interrupt 10 disable</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT11</name>
                  <description>Interrupt 11 disable</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT12</name>
                  <description>Interrupt 12 disable</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT13</name>
                  <description>Interrupt 13 disable</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT14</name>
                  <description>Interrupt 14 disable</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT15</name>
                  <description>Interrupt 15 disable</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT16</name>
                  <description>Interrupt 16 disable</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT17</name>
                  <description>Interrupt 17 disable</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT18</name>
                  <description>Interrupt 18 disable</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT19</name>
                  <description>Interrupt 19 disable</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT20</name>
                  <description>Interrupt 20 disable</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT21</name>
                  <description>Interrupt 21 disable</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT22</name>
                  <description>Interrupt 22 disable</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT23</name>
                  <description>Interrupt 23 disable</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT24</name>
                  <description>Interrupt 24 disable</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT25</name>
                  <description>Interrupt 25 disable</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT26</name>
                  <description>Interrupt 26 disable</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT27</name>
                  <description>Interrupt 27 disable</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT28</name>
                  <description>Interrupt 28 disable</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT29</name>
                  <description>Interrupt 29 disable</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT30</name>
                  <description>Interrupt 30 disable</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT31</name>
                  <description>Interrupt 31 disable</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
